Repository: OdyX/test-broken-commits
Catalog: debian/po/*.po
Languages: eu, gl, ja, nl, ru, sv

source: Do you want to set up the BSD lpd compatibility server?
eu: BSD lpd bateragarritasun zerbiztaria konfiguratu nahi al duzu?
gl: ¿Quere activar o servidor de compatibilidade con lpd de BSD?
ja: BSD lpd 互換サーバをセットアップしますか?
nl: Wilt u de server die zorgt voor compatibiliteit met de BSD-lpd instellen?
ru: Хотите установить сервер совместимости с BSD lpd?
sv: Vill du konfigurera den BSD-kompatibla lpd-servern?

source: This package contains a server that can accept BSD-style print jobs and submit them to CUPS. It should only be set up if you have other computers that submit jobs over the network via "BSD" or "LPR" services, and these computers cannot be converted to use the IPP protocol that CUPS uses.
eu: Pakete honek BSD-moduko inprimatze lanak onartu eta CUPS-era bidaltzen dituen zerbitzari bat du. Berau "BSD" edo "LPR" zerbitzuen bidez sare bidez lanak bidaltzen dituzten eta CUPS-ek erabiltzen duen IPP protokoloa erabili ezin duten ordenagailuak badituzu bakarrik konfiguratu behar da.
gl: Este paquete contén un servidor que pode aceptar traballos de impresión estilo BSD e envialos a CUPS. Só se debería activar se ten outros ordenadores que envían traballos pola rede mediante servizos "BSD" ou "LPR" e eses ordenadores non se poden converter para que empreguen o protocolo IPP que emprega CUPS.
ja: このパッケージは BSD スタイルの印刷ジョブを受け付け、CUPS にそれを送るサーバを含んでいます。"BSD" または "LPR" サービス経由でネットワーク越しにジョブを送るほかのコンピュータがあり、かつそれらのコンピュータは CUPS の使っている IPP プロトコルを使うよう変更できない、という場合にのみセットアップすべきです。
nl: Dit pakket bevat een server die BSD-stijl afdrukopdrachten kan accepteren om ze daarna naar CUPS te sturen. De server dient alleen ingesteld te worden als er andere computers zijn die afdrukopdrachten over het netwerk sturen via "BSD"- of "LPR" -services én deze computers niet kunnen worden ingesteld om het IPP-protocol (gebruikt door CUPS) te gebruiken.
ru: Этот пакет содержит сервер, который может принимать задания печати в стиле BSD и посылать их в CUPS. Его рекомендуется устанавливать только в том случае, если в сети есть другие компьютеры, которые отправляют задания по сети с помощью "BSD" или "LPR" сервисов, и эти компьютеры не могут работать с протоколом IPP, который используется в CUPS.
sv: Detta paket innehåller en server som kan acceptera utskriftsjobb av BSD-stil och skicka dom till CUPS. Den bör endast sättas upp om du har andra datorer som skickar jobb över nätverket via "BSD" eller "LPR"-tjänster och dessa datorer inte kan konverteras för att använda IPP-protokollet som CUPS använder.

source: Do you want CUPS to print unknown jobs as raw jobs?
eu: CUPS-ek lan ezezagunak lan gordinak bezala inprimatzea nahi duzu?
gl: ¿Quere que CUPS imprima os traballos descoñecidos coma traballos en cru?
ja: 未知のジョブを生データ (raw) ジョブとして CUPS に印刷させますか?
nl: Wilt u dat CUPS onbekende opdrachten onbewerkt naar de printer stuurt?
ru: Хотите чтобы CUPS печатал неизвестные задания как необработанные задания?
sv: Vill du att CUPS ska skriva ut okända jobb som "raw"-jobb?

source: All print jobs in IPP get a MIME type. Since not all sources of print jobs can attach an appropriate type, many jobs get submitted as the MIME type application/octet-stream. Because of this, when CUPS receives a job with that MIME type, it attempts to guess what the format is. By default, if it cannot guess the proper type, it rejects the job.
eu: IPP inprimatze lan guztiek MIME mota bat dute. Inprimatze lan jatorri guztiek ezin dutenez mota zuzena ezarri, lan gehienal application/octet-stream MIME mota erabiliaz bidaltzen dita. Honegatik CUP-ek MIME mota hoentako lan bat jasotzean zein formatukoa den antzematen saiatuko da. Lehenespen bezala dagokien mota antzeman ezin diren lanak ukatu egingo dira.
gl: Todos os traballos de impresión en IPP teñen un tipo MIME. Como non todas as fontes de traballos de impresión poden indicar un tipo axeitado, moitos traballos envíanse co tipo MIME application/octet-stream. Debido a isto, cando CUPS recibe un traballo con ese tipo MIME trata de adiviñar o formato. Por defecto, se non pode adiviñar o tipo correcto, rexeita o traballo.
ja: IPP でのすべての印刷ジョブは MIME 形式を持ちます。印刷ジョブのすべてのソースに適切な形式が付いているとは限らず、多くのジョブは MIME 形式 application/octet-stream として送られます。このため、CUPS はこのような MIME 形式付きのジョブを受け取ると、そのフォーマットは何かを推測しようとします。デフォルトでは、もし適当な形式を推測できない場合、そのジョブを拒否します。
nl: Alle afdrukopdrachten in IPP krijgen een MIME-type. Omdat niet alle bronnen van afdrukopdrachten een geschikt type aan de opdracht kunnen verbinden, worden veel opdrachten verstuurd als het MIME-type application/octet-stream. CUPS zal daarom als het een opdracht krijgt met dit MIME-type proberen te raden wat het bestandsformaat is. Standaard zal CUPS, als het niet is gelukt het formaat te raden, de opdracht afwijzen.
ru: Все задания печати с помощью IPP имеют тип MIME. Так как не все источники заданий печати могут присоединять соответствующий тип, многие задания посылаются с MIME типом application/octet-stream. Из-за этого, когда CUPS принимает задание с таким MIME типом, он пытается определить формат полученных данных. По умолчанию, если тип определить не удаётся, задание отбрасывается.
sv: Alla utskriftjobb i IPP får en MIME-typ. Eftersom inte alla källor för utskriftsjobb kan skicka med en lämplig typ blir många jobb skickade som MIME-typen "application/octet-stream". Av denna anledning försöker CUPS gissa vilket format det är när den tar emot ett jobb av den MIME-typen. Som standard nekar den att ta emot jobb om den inte kan gissa den korrekta typen.

source: It is possible to cause CUPS to treat all unrecognized jobs with this MIME type as "raw" jobs, which causes them to be sent directly to the printer without processing.
eu: Posible da CUPS-ek MIME mota honetako lanak lan "gordinak" bezala kudea ditzan, honela lan hauek prozesatu gabe bidaliko dira inprimagailura.
gl: É posible facer que CUPS trate todos os traballos que non recoñeza con este tipo MIME coma traballos "en cru", o que fai que se envíen directamente á impresora sen os procesar.
ja: この MIME 形式のすべての未知のジョブを、加工することなくプリンタに直接送るよう生データ（"raw"）ジョブとして扱うように CUPS を設定できます。
nl: Het is mogelijk om CUPS alle niet-herkende opdrachten met dit MIME-type te laten behandelen als onbewerkte opdrachten. Dit zorgt er voor dat de opdracht direct naar de printer wordt gestuurd zonder het verder te verwerken.
ru: Данная установка заставляет CUPS воспринимать нераспознанные задания с таким MIME типом как "сырые" задания, которые посылаются на принтер напрямую, без обработки.
sv: Det är möjligt att ställ in så att CUPS behandlar alla okända jobb med denna MIME-typ som "raw"-jobb vilket orsakar att de skickas direkt till skrivaren utan att behandlas först.

source: If you will be accepting print jobs from Windows computers, you probably want this option set, as Windows gives all IPP print jobs processed by a local driver the MIME type application/octet-stream. Samba also submits its print jobs this way.
eu: Windows ordenagailutik inprimatze lanak onartu behar badituzu, ziurrenik aukera hau gaitu beharko duzu Windows-ek kontrolagailu lokal batek prozesaturiko IPP inprimatze lan guztiei application/octet-stream MIME mota ezartzen bait die. Sama-k ere inprimatze lanak era hoentara bidaltzen ditu.
gl: Se vai aceptar traballos de impresión de ordenadores con Windows, probablemente sexa mellor activar esta opción, xa que Windows envía os traballos de impresión IPP procesados cun controlador local co tipo MIME application/octet-stream. Samba tamén envía os seus traballos de impresión do mesmo xeito.
ja: もし Windows コンピュータからの印刷ジョブを受け付ける場合、おそらくこのオプションを設定すべきです。というのも、Windows はすべての IPP 印刷ジョブをローカルドライバによって MIME 形式 application/octet-stream に加工するからです。Samba も同様にその印刷ジョブをこのやり方で送ります。
nl: Als u printopdrachten van Windows-computers wilt accepteren, dan kunt u deze optie het beste aanzetten. Windows geeft namelijk alle afdrukopdrachten die zijn verwerkt door een lokaal stuurprogramma het MIME-type application/octet-stream. Ook Samba verstuurt afdrukopdrachten op deze manier.
ru: Если вы получаете задания печати с компьютеров с Windows, то, вероятно, лучше установить этот параметр, так как Windows присваивает всем заданиям печати IPP, обработанным локальным драйверов MIME тип application/octet-stream. Samba также отправляет свои задания печати в таком виде.
sv: Om du vill att utskriftsjobb ska accepteras från Windows-datorer bör du antagligen välja denna funktion eftersom Windows sätter alla IPP-utskriftsjobb som hanteras av en lokal drivare till MIME-typen "application/octet-stream". Samba skickar också sina utskriftsjobb på detta sätt.

source: parallel
eu: paraleloa
gl: paralelo
ja: パラレル
sv: parallell

source: serial
eu: seriea
gl: serie
ja: シリアル
nl: serieel
sv: seriell

source: socket
ja: ソケット

source: Printer communication backends:
eu: Inprimagailu komunikazio motorea:
gl: Sistemas de comunicación coa impresora:
ja: プリンタ通信バックエンド:
nl: Backends voor printercommunicatie:
ru: Интерфейсные программы для связи с принтером:
sv: Baksystem för skrivarkommunikation:

source: CUPS uses backend programs for communication with printer device or port.
eu: CUPS-ek inrpimagailu gailu edo atakarekin komunikazioa lortzeko motoreak erabiltzen ditu.
gl: CUPS emprega varios programas para se comunicar co dispositivo ou porto da impresora.
ja: CUPS はプリンタデバイスまたはポートと会話するのにバックエンドプログラムを使います。
nl: CUPS gebruikt een backend-programma voor de communicatie met de printer of de printerpoort.
ru: CUPS использует интерфейсные программы для связи с устройством печати или портом.
sv: CUPS använder ett baksystemprogram för att kommunicera med skrivarenhet eller port.

source: Unfortunately, some backend programs cause some trouble. (For example, some PPC kernel crashes with the parallel backend)
eu: Zoritxarrez, zenbait motorek arazoak zor ditzakete. (Adibidez zenbait PPC kernel hasutura motore paraleloaz)
gl: Por desgracia, algúns destes programas causan problemas (por exemplo, algúns núcleos para PPC fallan co adaptador paralelo).
ja: 困ったことに、いくつかのバックエンドプログラムは問題を引き起こします。(たとえば、ある種の PPC カーネルは parallel バックエンドでクラッシュします)
nl: Helaas kunnen sommige backend-programma's problemen veroorzaken. (Bijv. sommige PPC-kernels kunnen vastlopen met de 'parallel'-backend.
ru: К сожалению, некоторые интерфейсные программы могут вызывать проблемы. (Например, некоторые ядра PPC падают при использовании интерфейса parallel)
sv: Tyvärr kan några baksystemprogram skapa problem. (Till exempel kan vissa PPC-kärnor krascha med parallella baksystem)

source: Please choose the backend program to be used by CUPS. The default choice should fit the most common environments.
eu: Mesedez hautatu CUPS-ek erabiliko duen komunikazio motorea. Aukera lehenetsiak ingurune arruntenetan funtzionatu beharko luke.
gl: Escolla o programa que debe empregar CUPS. A opción por defecto debería axustarse aos ambientes máis habituais.
ja: CUPS で利用したいバックエンドプログラムを選択してください。デフォルトの選択はたいていの一般的な環境に合っています。
nl: Kies een backend-programma dat door CUPS moet worden gebruikt. De standaardkeuze zou voor de meest voorkomende omgevingen moeten voldoen.
ru: Выберите интерфейсные программу, которая будет использоваться CUPS. Выбор по умолчанию должен работать с большинством оборудования.
sv: Vänligen välj det baksystemprogram som ska användas av CUPS. Det förvalda valet bör passa den flesta vanliga miljöer.

source: Port or/and host name where CUPS will listen to:
gl: Porto e/ou nome de servidor no que CUPS ha escoitar:
ja: CUPS が監視するポートまたはホスト名:
ru: Порт или/и имя машины через который будет осуществляться подключение к CUPS:
sv: Port och/eller värdnamn som CUPS lyssnar på:

source: Please specify the port or the host name CUPS daemon will listen to. The following formats are allowed:
gl: Especifique o porto ou nome de servidor no que ha escoitar o servizo de CUPS. Admítense os seguintes formatos:
ja: CUPS デーモンに監視させるポートまたはホスト名を指定してください。次のような書式を利用できます:
ru: Укажите порт или имя машины на котором будет работать демон CUPS. Допустимы следующие форматы:
sv: Vänligen ange porten eller värdnamnet som CUPS-demonen ska lyssna på. Följande format är tillåtna:

source: - Port number (631); - Host name (debian.example.com); - Host:Port (debian.example.com:631); - File domain socket (/var/run/cups/cups.sock).
ja: - ポート番号 (631); - ホスト名 (debian.example.com); - ホスト名:ポート (debian.example.com:631); - ファイルドメインソケット (/var/run/cups/cups.sock)。

source: You can combine any of these by delimiting in a space-separated list.
gl: Pode combinalos facendo unha lista de elementos separados por comas.
ja: スペースで区切ったリストでこれらを組み合わせることもできます。
ru: Можно использовать несколько любых типов, разделяя их пробелом.
sv: Du kan kombinera flera av dessa genom att avgränsa med mellanslag.

source: The default port 631 is reserved for the Internet Printing Protocol (IPP). "localhost:631" is recommended to setup a standalone environment for security reasons.
gl: O porto por defecto, 631, está reservado para o Protocolo de Impresión de Internet (IPP). Recoméndase que empregue "localhost:631" para crear un sistema aillado por motivos de seguridade.
ja: デフォルトポート 631 は Internet Printing Protocol (IPP) に予約されています。"localhost:631" はセキュリティ上の理由からスタンドアロンな環境にセットアップするのに推奨されます。
ru: Порт по умолчанию 631 зарезервирован для протокола печати в Интернет (Internet Printing Protocol, IPP). В целях безопасности для автономных систем рекомендуется использовать настройку "localhost:631".
sv: Standardport 631 är reserverad för Internet Printing Protocol (IPP). "localhost:631" är rekommenderad för att ställa in en fristående miljö av säkerhetsskäl.

source: Broadcast and/or listen for CUPS printer information on the network?
gl: ¿Emitir e/ou escoitar información de impresoras de CUPS na rede?
ja: ネットワーク上の CUPS プリンタ情報のブロードキャストおよび監視を行いますか?
ru: Анонсировать и/или слушать CUPS информацию о принтере в сети?
sv: Vill du sända ut och/eller lyssna efter skrivarinformation för CUPS på nätverket?

source: CUPS daemon can broadcast printer information for clients on the network, and detect printers on the network automatically.
gl: O servizo CUPS pode emitir información de impresoras para os clientes da rede, e pode detectar automaticamente as impresoras da rede.
ja: CUPS デーモンはネットワーク上のクライアントにプリンタ情報をブロードキャストしたり、ネットワーク上のプリンタを自動的に検出したりできます。
ru: Демон CUPS может анонсировать информацию о принтере для сетевых клиентов, и обнаруживать другие принтеры в сети автоматически.
sv: CUPS-demonen kan sända ut skrivarinformation för klienter på nätverket och automatiskt identifiera skrivare på nätverket.

source: If you choose this option, the CUPS daemon will periodically send UDP broadcasts to detect printers.
gl: Se escolle esta opción, o servizo CUPS ha enviar paquetes "broadcast" UDP para detectar as impresoras.
ja: この選択肢を選ぶと、CUPS デーモンはプリンタを検出するために UDP ブロードキャストを定期的に送ります。
ru: При выборе этого параметра демон CUPS будет периодически посылать широковещательные UDP пакеты для обнаружения принтеров.
sv: Om du valde detta alternativ kommer CUPS-demonen att med jämna mellanrum sända UDP-broadcast för att identifiera skrivare.

source: Incorrect value entered
gl: Introduciuse un valor incorrecto
ja: 不正な値が入力されました
ru: Введено недопустимое значение
sv: Felaktigt värde angivet

source: an error occurred while parsing the port number or the host name.
gl: houbo un erro ao analizar o número de porto ou o nome do servidor.
ja: ポート番号またはホスト名の解釈中にエラーが発生しました。
ru: при разборе номера порта или имени машины произошла ошибка.
sv: ett fel inträffade vid tolkning av portnumret eller värdnamnet.

source: Please correct your input.
gl: Corrixa o que introduciu.
ja: 入力値を修正してください。
ru: Пожалуйста исправьте вводимые данные.
sv: Vänligen rätt till det.

source: lpd
eu: lds
